# GetAssociatedGlobalParameter Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Parameter..::..GetAssociatedGlobalParameter Method
Parameter Class See Also
---
Returns a global parameter, if any, currently associated with this parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016 Subscription Update
# Syntax
C#
---
```text
public ElementId GetAssociatedGlobalParameter()
```

Visual Basic
---
```text
Public Function GetAssociatedGlobalParameter As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetAssociatedGlobalParameter()
```

# ### Return Value
Id of a global parameter or InvalidElemetnId.
# Remarks
InvalidElementId is returned in case this parameter is not associated with any global parameter. InvalidElementId is also returned if called for a parameter that cannot even be associated with a global parameters (i.e. a non-parametrizable parameter or parameter with a formula).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This parameter does not exist in the document anymore. |

# See Also
Parameter Class
Autodesk.Revit.DB Namespace